import { Box, Grid, Typography } from "@mui/material";
import StyledAccordion from "../Questions/Accordion";
import CurrencyBitcoinOutlinedIcon from "@mui/icons-material/CurrencyBitcoinOutlined";
import TollOutlinedIcon from "@mui/icons-material/TollOutlined";
import DiamondOutlinedIcon from "@mui/icons-material/DiamondOutlined";
import AccountBalanceWalletOutlinedIcon from "@mui/icons-material/AccountBalanceWalletOutlined";
import MemoryOutlinedIcon from "@mui/icons-material/MemoryOutlined";
import TokenOutlinedIcon from "@mui/icons-material/TokenOutlined";

export default function Academy() {
  const academyData = [
    {
      summary: "قدم اول",
      summarySub: "ارز دیجیتال چیست؟ آشنایی با تاریخچه و انواع آن",
      details:
        "ایده ارز دیجیتال، بسیار قدیمی‌تر از آن است که فکر می‌کنید. رد پای ارزهای دیجیتال را می‌توان در دهه ۱۹۸۰ یافت؛ در آن زمان به این دارایی‌های دیجیتال، ارزهای سایبری می‌گفتند و برنامه‌نویسان و رمزنگاران بسیاری تلاش می‌کردند تا با کمک آن‌ها سامانه‌ای بی‌نیاز از نظارت بانک‌ها و دولت‌ها راه‌اندازی کنند. در سال ۲۰۰۸ برنامه‌نویس یا گروهی از برنامه‌نویسان با نام مستعار ساتوشی ناکاموتو تصمیم گرفتند تا شانس خود را امتحان کرده و درنهایت در سال ۲۰۰۹، اولین ارز دیجیتال حقیقی را با نام بیت کوین (Bitcoin) به جهان معرفی کردند. بیت کوین، مشکل دوبار خرج کردن را با استفاده از فناوری جدیدی به نام بلاک چین (Blockchain)، برطرف می‌کرد؛ این فناوری، دفتر کل توزیع شده‌ای است که تمام تراکنش‌های بیت کوین در آن به صورت رمزنگاری‌شده ثبت می‌شوند. هر تراکنش، قبل از اضافه شدن به بلاک چین، ابتدا توسط شبکه‌ای از کامپیوترهای مخصوص به نام ماینرها (Miners)، تایید شده و سپس با حل معماهای ریاضی پیچیده، تراکنش‌ها را صحت‌سنجی می‌کنند. ماینر‌ها در ازای این تلاش خود، پاداش‌هایی در قالب سکه‌های جدید بیت کوین دریافت می‌کنند.",
      expanded: true,
      titleIcon: <TollOutlinedIcon />,
    },
    {
      summary: "قدم دوم",
      summarySub: "فناوری بلاک چین و کاربرد‌های آن",
      details:
        "بیت کوین یکی از انواع ارزهای دیجیتال (کوین) است که به منظور انتقال سریع، امن و ارزان پول بدون نیاز به هیچ بانک یا واسطه ای ایجاد شده است. بیت کوین ها در کیف پول های اختصاصی ذخیره شده و به صورت الکترونیکی انتقال پیدا می کنند. پس از معرفی در سال 2009، ارزش بیت کوین به دلیل مقدار محدود و افزایش محبوبیت و تقاضا، به سرعت افزایش یافته است.",
      titleIcon: <CurrencyBitcoinOutlinedIcon />,
    },
    {
      summary: "قدم سوم",
      summarySub: "از بیت کوین تا آلت کوین؛ در دنیای رمزارزها چه می‌گذرد؟",
      details:
        "بلاک چین شبکه‌ای غیرمتمرکز است که هیچ نهاد واسطه‌ای، مانند بانک یا دولت، به محتوای آن دسترسی نداشته و به جای این واسطه‌ها، اعضای شبکه مسئولیت اجرا و تأیید تراکنش‌های رمزارز را برعهده می‌گیرند. همین موضوع، سرعت بالا، شفافیت و هزینه پایین را برای این دارایی‌های دیحیتال به ارمغان می‌آورند. آلت کوین (AltCoin)، از دو کلمه‌ی Alternative و Coin تشکیل شده و به معنای ارز جایگزین است. آلت کوین‌ها، رمزارزهایی هستند که بعد از بیت کوین و به هدف برطرف کردن نقاط ضعف یا محدودیت‌های بیت کوین به وجود آمده‌اند. برای خرید رمزارز، به کیف پول رمزارز (Wallet) و صرافی ارز دیجیتال (Exchange) نیاز خواهید داشت. کیف پول‌های رمزارز، نرم‌افزار‌ها یا سخت‌افزارهایی هستند که در دو نوع سرد و گرم ارائه شده و کلید‌های خصوصی و عمومی شما را ذخیره می‌کنند. صرافی‌های ارز دیجیتال هم پلتفرم‌های آنلاین است که در دو نوع متمرکز (Centralized) و غیرمتمرکز (Decentralized) خدمات ارائه می‌دهند.",
      titleIcon: <DiamondOutlinedIcon />,
    },
    {
      summary: "قدم چهارم",
      summarySub: "کیف پول ارز دیجیتال چیست؟",
      details:
        "اگر به دنبال خرید، فروش، نگهداری یا استفاده از ارزهای دیجیتال هستید، آشنایی با مفهوم کیف پول ارز دیجیتال، از مهم‌ترین اقداماتی است که در همان ابتدای راه باید انجام دهید. کیف پول ارز دیجیتال، اپلیکیشن، افزونه، دستگاهی یا حتی تکه کاغذی است که امکان مدیریت رمزارزها را برای شما فراهم می‌کند و حاوی کلید عمومی و کلید خصوصی برای مدیریت دارایی‌های دیجیتالی شما است. در بخش‌های قبلی آشناشدیم که کلیدهای اصلی کیف پول کدام‌ها هستند. کلید عمومی که برخی آن را آدرس کیف پول نیز می‌نامند، رشته‌‌ای از حروف و اعداد است که به عنوان شناسه شما در شبکه بلاک چین عمل می‌کند. شما برای دریافت رمزارز باید این آدرس را در اختیار دیگران قرار دهید و به نحوی همان نقش شماره حساب بانکی را در نقل‌ وانتقالات بانکی ایفا می‌کند. کیف پول‌های ارز دیجیتال به دو دسته کلی تقسیم می‌شوند: سرد (Cold) و گرم (Hot). کیف پول‌های سرد به کیف پول‌هایی گفته می‌شوند که در قالب دستگاهی فیزیکی ارائه شده و به طور مدام به اینترنت متصل نیستند. در مقابل کیف پول‌های گرم به کیف پول‌های نرم‌افزاری گفته می‌شوند که مداوما به اینترنت دسترسی دارند.",
      titleIcon: <AccountBalanceWalletOutlinedIcon />,
    },
    {
      summary: "قدم پنجم",
      summarySub: "معامله ارزهای دیجیتال؛ نکات و استراتژی‌ها",
      details:
        "قبل از شروع به معامله، باید با مفاهیم و اصطلاحات رایج در بازار رمزارز آشنا شوید. برخی از این مفاهیم عبارت‌اند از: نقطه حمایت (Support)، نقطه مقاومت (Resistance)، روند صعودی (Uptrend)، روند نزولی (Downtrend)، خط روند (Trendline)، الگوهای قیمتی (Price Patterns)، کندل‌ استیک‌ها (Candlesticks)، حجم معاملات (Volume) و ایندیکیتورها (Indicators). ابتدا باید پلتفرم مناسبی برای خرید و فروش رمزارز انتخاب کنید. پلتفرم‌های مختلف، ویژگی‌ها، قابلیت‌ها، هزینه‌ها و سطوح امنیتی متفاوتی ارائه می‌دهند؛ بیت‌پین (Bitpin) برای کاربران ایرانی و بایننس (Binance)، کوین‌بِیس (Coinbase)، کُراکِن (Kraken) و هیوبی (Huobi) برای کاربران خارجی، مثال‌هایی از این پلتفرم‌ها هستند. سپس لازم است تا کیف پول ارز دیجیتال مناسبی برای نگهداری رمزارز خود داشته باشید. حال نوبتِ آن است که یک استراتژی معاملاتی برای خود تعریف کنید؛ استراتژی‌های معاملاتی، هدف‌گذاری‌ها، ریسک‌ها، بازده‌ها، بازارها و روش‌های معاملاتی خاص خود را دارند. بسته به شخصیت، سبک زندگی و تجربه خود می‌توانید از بین استراتژی‌های مختلف، یکی را انتخاب کنید؛ برخی از این استراتژی‌های رایج عبارت‌اند از: اسکلپینگ (Scalping)، معامله معکوس (Reverse Trading)، مومنتوم تریدینگ (Momentum Trading)، آربیتراژ (Arbitrage)، استراتژی خرید و نگه‌داری (Buy and Hold)، معامله سوئینگ (Swing Trading) و معامله حجم (Volume Trading). شما در این راه باید به تحلیل بازار رمزارزها اهمیت دهید؛ تحلیل بازار شامل دو بخش تحلیل تکنیکال (فنی) و تحلیل فاندامنتال (بنیادین) است. تحلیل تکنیکال به بررسی الگوها، ایندیکارتور‌ها و روندهای قیمتی، با استفاده از نمودارها و ابزارهای مختلف می‌پردازد. تحلیل فاندامنتال به بررسی عوامل خارج از بازار مانند خبر، قانون، فناوری و… می‌پردازد که بر قیمت رمزارزها تأثیر دارند. تحلیل بنیادین به شما کمک می‌کند تا رمزارزهای با پتانسیل رشد و ارزش بالا را شناسایی کنید.",
      titleIcon: <MemoryOutlinedIcon />,
    },
    {
      summary: "قدم ششم",
      summarySub: "NFT چیست و چه کاربردی دارد؟",
      details:
        "ان اف تی (مخفف عبارت Non-Fungible Token) یا توکن غیرقابل تعویض، اصطلاحی اقتصادی برای توصیف اقلامی مانند نقاشی، فایل موسیقی و پاداش‌ بازی‌های ویدیویی است. به زبان ساده، NFT‌ها توکن‌های دیجیتالی هستند که منحصربه‌فرد و غیرقابل معاوضه هستند. برای، شما نمی‌توانید یک NFT را با یک NFT دیگر معاوضه کنید، چون هر کدام از آن‌ها ارزش و ویژگی‌های خاص خود را دارند. NFT‌ها بر پایه فناوری بلاک چین ساخته شده و به عنوان گواهینامه‌های مالکیت دیجیتال برای هر نوع دارایی دیجیتال یا فیزیکی عمل می‌کنند. بلاک چین سامانه‌ی ثبت رسمی و غیرمتمرکز است که تمام تراکنش‌های انجام شده را به صورت رمزگذاری‌شده ذخیره می‌کند و به این ترتیب می‌توانید از یگانه بودن NFT خود اطمینان حاصل کنید. NFT‌ها نوع جديدی از توكن‌های ديجيتالی هستند كه به عنوان گواهينامه‌های مالكيت ديجيتال عمل کرده و با استفاده از فناوری بلاك چين ساخته شده‌اند. NFT‌ها در حوزه‌های مختلف، کاربردهای زياد و جذابی دارند و در حال حاضر يكي از پديده‌های جديد، پرطرفدار و در حال گسترش در دنيای رمزارزها هستند. NFT‌ها به کاربران این امکان را می‌دهند تا دارایی‌های دیجیتالی خود به صورت امن و شفاف مدیریت کرده و از آن‌ها کسب درآمد کنند.",
      titleIcon: <TokenOutlinedIcon />,
    },
  ];
  return (
    <Grid container mt={5}>
      <Grid item xs={12} md={8} margin={"0 auto"}>
        <Box padding={4}>
          <Typography mb={2} variant="h4" color={"#33BBC5"} fontWeight={"800"}>
            آکادمی
          </Typography>
          <StyledAccordion accordionList={academyData} />
        </Box>
      </Grid>
    </Grid>
  );
}
