import { Grid, Typography } from "@mui/material";

export default function Magezine() {
  let today = new Date().toLocaleDateString("fa-IR");
  return (
    <Grid container display={"flex"} justifyContent={"center"} mt={7} px={7}>
      <Grid item xs={12} mb={4}>
        <Typography textAlign={"center"} fontWeight={"bold"} fontSize={"1.3em"}>
          بروزرسانی شده در تاریخ {today}
        </Typography>
      </Grid>
      <Grid item xs={12}>
        <Grid container>
          <Grid item xs={12}>
            <Typography variant="h5" fontWeight={"bold"} mb={1}>
              مقدمه:
            </Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography mb={2} fontSize={"0.9em"} lineHeight={"30px"}>
              وب‌سایت و پلتفرم ارزینو از هر حیث تابع قوانین و مقررات کشور جمهوری
              اسلامی ایران است و هیچ‌گونه تبادل ارزی اعم از خریدوفروش دلار یا
              سایر ارزهای کاغذی، در این بستر صورت نمی‌گیرد.
              <br /> نظر به قانون تجارت الکترونیکی مصوب ۱۳۸۲، موضوع قرارداد
              حاضر، تدوین حقوق، تکالیف، مسئولیت‌ها و نیز دستورالعمل‌های
              لازم‌الاجرا بین ارزینو و کاربران ارزینو است. بنابراین، طرفین ملزم
              به ایفای تعهدات مندرج در این قرارداد هستند و قبول مندرجات قرارداد
              حاضر و ایجاد حساب کاربری به‌منزله‌ی امضا تلقی شده و طرفین را متعهد
              به اجرای آن می‌کند.
              <br /> ارزینو خود را ملزم می‌داند، هرگونه تغییر در مفاد این
              قرارداد که از سوی ارزینو صورت می‌پذیرد و یا از طرق دیگر ابلاغ
              گردد، قبل از تاریخ اجرای آن، سریعاً از طریق راه‌های ارتباطی به
              اطلاع کاربر برساند. همچنین، تاریخ به‌روزرسانی تغییرات در بالای
              همین صفحه درج می‌گردد و هر کاربر می‌تواند از این طریق متوجه بروز
              تغییرات یا به‌روزرسانی مقررات شود. بدیهی است هرگونه استفاده کاربر
              پس از بروز تغییرات به منزله آگاهی وی از تغییرات و تعهد به پایبندی
              به مقررات جدید است.
              <br /> استفاده از هرگونه امکانات سایت و پلتفرم ارزینو (شامل خرید،
              فروش، واریز و برداشت) و هرگونه امکانات دیگر به این معنی است که
              کاربر مفاد این قرارداد را به‌طور کامل مطالعه کرده و پذیرفته است،
              در غیر این صورت و در صورت عدم موافقت کاربر با مفاد قرارداد، کاربر
              حق استفاده از خدمات سایت و پلتفرم ارزینو را ندارد. طرفین این
              قرارداد، پلتفرم اینترنتی ارزینو به‌عنوان «ارائه‌دهنده خدمات» و
              کاربر ارزینو به‌عنوان «گیرنده خدمات» است.
            </Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography variant="h5" fontWeight={"bold"} mb={1}>
              شرایط عضویت و افتتاح حساب:
            </Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography mb={2} fontSize={"0.9em"} lineHeight={"30px"}>
              کاربر موظف است فقط از طریق کارت‌های بانکی که در سایت ثبت و
              تأییدشده‌اند، تراکنش خود را انجام دهد. در صورت خرید با کارت‌هایی
              جز کارت‌های اعلام‌شده در سایت، ارزینو هیچ مسئولیتی در قبال
              تراکنش‌های ناموفق این کارت‌ها برعهده نمی‌گیرد.
              <br /> ۱-۲- احراز هویت برای استفاده از خدمات ارزینو ضروری بوده و
              کاربران موظف هستند اطلاعات صحیح خود را در سامانه بارگذاری کنند.
              بدیهی است در صورت وجود هرگونه تخلف در احراز هویت، مسئولیت بر عهده
              کاربر بوده و ارزینو حق توقف ارائه خدمات به کاربر مزبور را داشته و
              مراتب تخلف را به مراجع ذیصلاح اعلام خواهد کرد.
              <br /> ۱-۳- این حق برای ارزینو محفوظ است که هرگونه اطلاعات لازم
              برای احراز هویت را بعد از ثبت سفارش خریدوفروش از کاربر بخواهد؛ در
              این صورت، تا احراز کامل هویت، امکان استفاده از خدمات ارزینو وجود
              نخواهد داشت.
              <br /> ۱-۴- فرآیند احراز هویت شامل گردآوری اطلاعات کاربر، از جمله:
              شماره همراه، کارت شناسایی با تصویر سلفی، کد ملی و متن تعهدنامه
              امضا شده با تصویر سلفی کاربر، سند مالکیت یا اجاره‌نامه و اطلاعات
              بانکی است. ارزینو خود را ملزم به نگه‌داری کامل از اطلاعات شخصی
              کاربران می‌داند و متعهد می‌شود از این اطلاعات هیچ‌گونه استفاده‌ای
              نخواهد شد.
              <br /> ۱-۵- تصمیم راجع به موفق یا ناموفق بودن احراز هویت فقط و فقط
              در اختیار ارزینو خواهد بود و ارزینو می‌تواند یک احراز هویت را به
              تشخیص خود قبول یا رد کند.
            </Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography variant="h5" fontWeight={"bold"} mb={1}>
              تعهدات کاربر در استفاده از خدمات ارزینو:
            </Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography mb={2} fontSize={"0.9em"} lineHeight={"30px"}>
              ۲-۱- کاربر، متعهد است از خدمات ارزینو تنها برای خود استفاده کند.
              مسئولیت مالی و قضایی استفاده از خدمات ارزینو به‌منظور خریدوفروش
              برای شخص ثالث (اجاره دادن حساب کاربری) مطابق تعهدنامه ارسالی بر
              عهده خود کاربر است. شماره حساب اعلام‌شده به پلتفرم و همچنین نشانی
              کیف پول‌ها جهت برداشت رمزارز نیز باید متعلق به شخص کاربر بوده، و
              کاربران مجاز به دادن نشانی کیف پول متعلق به اشخاص ثالث نیستند.
              <br />
              ۲-۲- ایجاد حساب کاربری، عضویت و استفاده از خدمات ارزینو برای افراد
              زیر ۱۸ سال ممنوع است.
              <br /> ۲-۳- هر شخص تنها می‌تواند یک حساب کاربری برای خود داشته
              باشد و حساب کاربری ایجادشده، قابل انتقال به غیر نیست.
              <br /> ۲-۴- ایجاد و استفاده از دو یا چند نام کاربری برای یک شخص در
              پلتفرم ارزینو ممنوع است و در صورت تخطی کاربر از این موضوع، کلیه
              حساب‌های ایشان مسدود خواهد شد.
              <br /> ۲-۵- در صورت بی‌احتیاطی کاربر و افشای اطلاعات کاربری یا رمز
              عبور، کلیه مسئولیت‌های قانونی بر عهده کاربر بوده و ارزینو مسئولیتی
              در قبال خسارت‌های احتمالی نخواهد داشت. در این صورت، کاربر موظف است
              در اسرع وقت موضوع را به اطلاع ارزینو رسانده و پیگیری لازم را به
              عمل آورد.
              <br /> ۲-۶- همه فعالیت‌ها و عملیات انجام‌شده از طریق حساب کاربری
              شخص در ارزینو، به نام کاربر ثبت شده و کلیه مسئولیت‌های آن برعهده
              کاربر است. برهمین اساس، کاربر متعهد می‌شود در صورت مشاهده هرگونه
              استفاده غیرمجاز یا مشکوک از حساب کاربری خود، مراتب را در اسرع وقت
              به پشتیبانی سایت ارزینو اعلام نماید.
              <br /> ۲-۷- ارزینو به‌عنوان بازار آنلاین تبادل ارزهای دیجیتال است
              و هیچ‌گونه مسئولیتی در قبال نحوه‌ی معاملات کاربران ندارد. در صورتی
              که کاربران از طرق غیرمعمول که شامل حمله هکرها، تغییر قوانین ارزهای
              دیجیتال در سطح بین‌الملل، زمان به‌روزرسانی پلتفرم یا مشکلات
              احتمالی پلتفرم، معامله‌ای انجام دهند بیت پین می‌تواند به تشخیص خود
              تمامی معاملات را به حالت قبل برگرداند و پس از رفع موضوع برای
              استفاده مجدد به کاربر اطلاع دهد.
              <br /> ۲-۸- مسئولیت اطلاعات لازم در طی سفارش و ارائه نشانی صحیح
              کیف پول برای برداشت و انتقال ارزهای دیجیتال بر عهده‌ی کاربر است.
              کلیه‌ی مسئولیت‌های مربوط به اشتباه وارد کردن اطلاعات در خلال سفارش
              اعم از اشتباه در ورود نشانی صحیح، نقص نشانی، مشکلات کیف پول مقصد و
              بلوکه شدن دارایی‌های کاربران در کیف پول مقصد، با خود کاربر است و
              ارزینو مسئولیتی در قبال تراکنش‌های دارای اشتباه در نتیجه قصور یا
              تقصیر کاربر، ندارد.
              <br /> ۲-۹- درخواست برداشت ریال از حساب کاربری در سریع‌ترین زمان
              ممکن پس از ثبت، بررسی خواهد شد. زمان واریز پول به‌حساب کاربران بر
              اساس محدودیت‌های انتقال وجه بین‌بانکی (وفق ضوابط اعلامی بانک مرکزی
              جمهوری اسلامی ایران)، متفاوت خواهد بود. برای اطلاعات بیشتر، به
              قوانین انتقال وجه بین بانکی (پایا- ساتنا) مراجعه فرمایید.
              <br /> ۲-۱۰- ارزینو تعهدی به پرداخت سود مربوط برای ریال موجود در
              کیف پول الکترونیکی کاربر، نخواهد داشت.
              <br /> ۲-۱۱- در صورت انجام اشتباه در محاسبات یا منظور کردن وجوه یا
              رمزارز تحت هر عنوان سهواً یا من غیر حق به‌حساب کاربر توسط ارزینو،
              کاربر به ارزینو وکالت می‌دهد که بدون انجام هرگونه تشریفات اداری و
              قضائی و بدون دریافت اجازه کتبی از کاربر (صاحب حساب) در رفع اشتباه
              و برداشت از حساب‌های وی اقدام نماید.
              <br /> ۲-۱۲- در صورت بروز هرگونه مشکل یا ابهام در هر یک از
              معاملات، ارزینو این حق را خواهد داشت مستقلاً بدون نظرخواهی از
              طرفین درگیر در معامله، آن معامله را ابطال و دارایی‌های هریک از
              طرفین را به حساب خودشان عودت دهد. بدیهی است در صورت بروز اشتباه از
              جانب ارزینو، ارزینو موظف خواهد بود که خسارت طرفین را جبران کند.
            </Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography variant="h5" fontWeight={"bold"} mb={1}>
              تغییر در قوانین:
            </Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography mb={2} fontSize={"0.9em"} lineHeight={"30px"}>
              هرگونه تغییر در قوانین، شروط ارائه خدمات و مقررات مشابه، از طریق
              کانال‌های ارتباطی ارزینو به اطلاع کاربران خواهد رسید.
            </Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography variant="h5" fontWeight={"bold"} mb={1}>
              روش حل‌وفصل اختلافات و قانون حاکم:
            </Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography mb={2} fontSize={"0.9em"} lineHeight={"30px"}>
              ۶-۱- این قرارداد بر اساس قوانین جمهوری اسلامی ایران، قطع نظر از
              تابعیت یا محل سکونت کاربر تفسیر شده و تابع آن خواهد بود.
              <br /> ۶-۲- محل انعقاد و اجرای این قرارداد، شهرستان بندرانزلی
              (اقامتگاه شرکت سنا ایمن مبادله به عنوان واحد عملیات ارزینو) است. و
              کلیه دعاوی و اختلافات ناشی از استفاده از خدمات ارزینو فارغ از محل
              اقامت کاربر قابل طرح و پیگیری در مراجع قضایی شهرستان بندرانزلی
              خواهد بود.
              <br />
              ۶-۳-کاربر با علم و اطلاعات کامل از تمامی مقررات مندرج و اشاره‌شده
              در پلتفرم ارزینو اقدام به خرید وفروش ارزهای دیجیتال می‌نماید و
              آسیب‌های تخلف یا نادیده گرفتن هرکدام از موارد بالا بر عهده کاربر
              خواهد بود و ارزینو مسئولیتی بر عهده نخواهد داشت.
            </Typography>
          </Grid>
        </Grid>
      </Grid>
    </Grid>
  );
}
